start_text = "assalomu aleykum botga xush kelibsiz"

echo_order_text = "Buyurtmani olib keting yoki yetkazib berish ni bosing"

echo_dostavka_text = "end yaqin shaxobcha"

text_in_info = "информатция"

text_introduse_delivery = """
10:00 _ 22:00 - 1 km gacha bo`lgan buyurtmalar yetkazib berish narxi 5000 so`m\
10:00 _ 22:00 - 3 km gacha  9000 so`m, keyingi har 1 km uchun - 1000 so`m Toshkent shahari bo`ylab.
"""

text_in_publicoffer = """
    Публичная оферта
Договор-оферты об осуществлении продажи через Телеграм-бот
Настоящий договор-оферты об осуществлении продажи через Телеграм-бот (далее
– «Условия») устанавливают существенные условия оказания услуг по
изготовлению и реализации продукции общественного питания и других товаров.
Условия являются публичной офертой - предложением о заключении Договора
розничной купли-продажи товаров и оказания услуг общественного питания и их
доставки Продавцом Покупателю. Покупатель, ознакомившись с настоящими
Условиями, присоединяется к ним и выражает свое согласие с ними путем
совершения действий, указанных в настоящих Условиях.
Через Телеграм-бот предоставлена информация об основных потребительских
свойствах Товара, об адресе (месте нахождения) продавца, о месте изготовления
товара, о полном фирменном наименовании (наименовании) продавца
(изготовителя), о цене и об условиях приобретения товара, о его доставке, о
порядке оплаты товара, сроке годности, а также о сроке, в течение которого
действует предложение о заключении Договора.

1. Термины
1.1. Покупатель – физическое лицо, имеющее намерение заказать или
заказывающее Товар через Телеграм-бот @lesailesbestbot, использующее услуги
общественного питания исключительно для личных, семейных, домашних и иных
нужд, не связанных с осуществлением предпринимательской деятельности и
согласившееся на приобретение товаров и оказание услуг общественного питания
в соответствии с настоящими Условиями.
1.2. Продавец – ООО «PERESPECTIVE UNION»
1.3. Товар – продукция в соответствии с ассортиментом, представленным
Телеграм-ботом Продавца по адресу: t.me/lesailesbestbot;
1.4. Заказ – отдельные позиции (позиция) из ассортиментного перечня Товаров,
выбранные и заказанные Покупателем через Телеграм-бот Продавца и
оформленные на доставку по указанному Покупателем адресу;
1.5. Телеграм-бот – программа (бот), работающая на базе мессенджера Telegram с
именем пользователя @lesailesbestbot.
1.6. Колл-центр – подразделение Продавца, занимающееся обработкой заказов и
информированием по голосовым каналам связи через телефонный номер +99871
200-42-42.
1.7. Служба доставки – сотрудники Продавца либо представители Продавца,
осуществляющие доставку Товаров Покупателю.

2. Общие положения
2.1. Настоящие Условия, а также информация о Товаре и услугах, представленная
через Телеграм-бот , являются публичной офертой в смысле статьи 367 и пункта 2
статьи 369 ГК Республики Узбекистан на заключение Договора розничной купли-
продажи товаров и услуг.
2.2. К отношениям между Покупателем и Продавцом применяются положения
Гражданского кодекса Республики Узбекистан, Закона Республики Узбекистан «О
защите прав потребителей», Правила производства и реализации продукции
(услуг) общественного питания в Республике Узбекистан, и иные правовые акты,
принятые в соответствии с ними.
2.3. Продавец оставляет за собой право вносить изменения в настоящие Условия и
публиковать Условия с внесенными изменениями через Телеграм-бот .
2.4. Покупатель соглашается с настоящими Условиями, принимает их и
присоединяется к условиям настоящего Соглашения следующим образом:
- нажатием кнопки «Оформить заказ» на последнем этапе оформления Заказа в
Телеграм-боте,
- самостоятельной регистрацией в Телеграм-боте,
- подтверждением заказа по телефону через Колл-центр.
2.5. Заказ Товара, оформленный Покупателем через Телеграм-бот является
подтверждением заключенного между Продавцом и Покупателем Договора.
2.6. Право собственности на Товары переходит к Покупателю в момент приемки
Товаров Покупателем и оплаты последним полной стоимости принятых Товаров.
Риск случайной гибели или повреждения Товаров переходит к Покупателю с
момента приемки Товаров Покупателем.
2.7. Принимая (акцептируя) настоящие Условия, Покупатель подтверждает свое
согласие и разрешает Продавцу обрабатывать свои данные, в том числе: имя,
адрес доставки, телефон, адрес электронной почты. Под обработкой персональных
данных в настоящих Условиях понимается: сбор вышеуказанных данных, их
систематизация, накопление, хранение, уточнение (обновление, изменение),
использование, блокирование, уничто жение, передача третьим лицам в целях
проведения маркетинговых мероприятий и исследований.
2.8. Принимая настоящие Условия, Покупатель выражает согласие и разрешает
Продавцу и его службам обрабатывать персональные данные Покупателя с
помощью автоматизированных систем управления базами данных, а также иных
программных и технических средств, выражает согласие на получение sms-
сообщений, на участие в маркетинговых акциях и мероприятиях, а также на
получение рекламных сообщений.
2.9. Продавец обязуется обеспечивать конфиденциальность предоставленных
Покупателем персональных данных, их защиту от копирования, распространения. В
любой момент Покупатель вправе запросить перечень своих персональных данных
и/или потребовать изменить, заблокировать либо уничтожить свои персональные
данные, позвонив Продавцу по телефону +99871 2004242, указав имя, телефон,
Email адрес, а также адрес доставки.

3. Оформление и сроки выполнения Заказа
3.1. Заказ может быть оформлен Покупателем одним из следующих способов:
- с помощью размещения Заказа через Колл-центр,
- с помощью Телеграм-бота.
3.2. При оформлении Заказа посредством  Телеграм-бота Покупатель
подтверждает, что он ознакомлен с настоящими Условиями и предоставляет
Продавцу всю информацию, необходимую для надлежащего оформления и
исполнения Заказа.
3.3. Для оформления Покупателем Заказа при помощи Телеграм-бота необходимо
выбрать подходящий товар из разделов «Меню», выбрать количество товара и
добавить Товар(ы) в корзину. При заказе двух и более позиций Товара описанные
операции необходимо повторить в отношении каждой товарной позиции. Далее,
необходимо перейти в раздел «Корзина», в «Корзине» проверить количество и
перечень заказываемого Товара (при необходимости изменить соответствующие
сведения), далее нажать кнопку «Оформить заказ». На открывшейся странице
заполнить обязательные поля, касающиеся личных данных, а также адреса
доставки Покупателя, выбрать время доставки, способ оплаты заказа и нажать
кнопку «Оформить заказ». Нажимая кнопку «Оформить заказ» и «Заказать»,
Покупатель завершает оформление Заказа. После этого сотрудники Продавца, при
необходимости, могут связаться с Покупателем для подтверждения указанных
сведений либо с целью корректировки заказа.
3.4. При оформлении Заказа посредством Телеграм-бота Покупатель должен
указать следующую информацию:
-имя;
-контактный телефон;
- сведения о месте доставки (включая город, улицу, дом, корпус/строение, №
квартиры/офиса, подъезд, этаж, код домофона, комментарии к адресу доставки);
- комментарии и промокод (при необходимости);
3.5. После оформления заказа Клиенту предоставляется информация о статусе
исполнения Заказа, в том числе о сроке доставки Товара.
3.6. Доставка заказов осуществляется по территории городов Андижан, Карши,
Ташкент и Фергана на условиях действующих через Телеграм-бот на момент
оформления заказа:
Пн-Сб: с 10:00 до 03:00
Вс: 11:00 до 03:00
3.7. Ответственность за содержание и достоверность информации,
предоставленной Покупателем при оформлении Заказа, несет Покупатель. Если
при оформлении Заказа Покупателем была указана неправильная информация, в
том числе неправильный адрес, неправильные телефоны, адреса электронной
почты и другие данные, Продавец не несет ответственность за возникшие в связи с
указанными обстоятельствами последствиями в виде невозможности исполнения
Заказа, его доставки по указанному адресу, неполучения Покупателем
подтверждения оформления Заказа на указанный им адрес.
3.8. Вся информация о Товаре, представленная через Телеграм-бот носит
информационный характер, не является рекламой и не может в полной мере
передавать всю информацию о свойствах и характеристиках Товара.
3.9. Фото, схемы, рисунки, видеоизображения образцов Товара в каталоге являются
собственностью Исполнителя. Каждое изображение образца сопровождается
текстовой информацией о Товаре.
3.10. В случае отсутствия заказанных Товаров у Продавца (в том числе – по
причинам, не зависящим от него), Продавец вправе исключить указанный Товар из
Заказа и уведомить об этом Покупателя по телефону в течение 20 минут с момента
совершения таких дей ствий.
3.11. Покупатель может получить оформленный Заказ путем доставки Товара
службой доставки Продавца либо лично прибыть в ресторан Продавца, получить
оформленный Заказ и произвести оплату.

4. Доставка Товара.
4.1. Продавец приложит все усилия для соблюдения сроков доставки, указанных на
Сайте, тем не менее, задержки в доставке возможны ввиду непредвиденных
обстоятельств, произошедших не по вине Продавца.
4.2. В случае отсутствия Покупателя (либо Получателя) в назначенных месте и
времени доставки, сотрудник Службы доставки ожидает 10 минут, после чего
уезжает.
4.3. Передача заказа
- Покупатель обязуется проверить комплектацию всего Заказа (ассортимент) и
каждого Товара в отдельности;
- В случае отсутствия претензий к Товарам Покупатель оплачивает сотруднику
Службы доставки либо сотруднику ресторана их стоимость (если платеж не был
осуществлен ранее) и получает фискальный чек.
- При авансовой оплате Заказа (с помощью электронных платежных систем и пр.),
Покупатель (либо назначенный им Получатель) обязан предъявить документ,
удостоверяющий личность.
4.4. В случае недоставки Товара Продавец возмещает Покупателю стоимость
предоплаченного, но не полученного Товара после подтверждения данного
обстоятельства со стороны Службы доставки.
4.5. При доставке Товар вручается Покупателю либо лицу, указанному в качестве
Получателя.
4.6. Во избежание случаев мошенничества при вручении предоплаченного Товара
сотрудник Службы доставки вправе затребовать документ, удостоверяющий
личность Получателя. Продавец гарантирует конфиденциальность и защиту
персональной информации, полученной от Получателя.
4.7. В случае неполучения Заказа покупателем по его вине, стоимость Товара и его
доставки не компенсируются. Денежные средства за нее не возвращаются.
4.8. Если Покупатель оплатил и не забрал товар в оговоренные сроки, Исполнитель
имеет право не возвращать оплату за Товар Покупателю.
4.9. Исполнитель имеет право изменить время передачи товаров, уведомив об этом
покупателя услуг не позднее оговоренного времени отгрузки заказа, получив
подтверждение о согласии Покупателя с изменениями. Покупатель имеет право
отказаться от внесения изменений в данные заказанной услуги, на основании чего
услуги будут считаться отмененными с последующим возвратом денежных средств
на карту, с которой производилась оплата.

5. Оплата товара
5.1. Цена Товара указывается через Телеграм-бот .
5.2. Цена Товара может быть изменена Продавцом. При этом стоимость Заказа,
оговоренная при подтверждении его оформления, изменению в одностороннем
порядке, не подлежит.
5.3. Способы оплаты Товара:
- Наличными денежными (в национальной валюте сум) средствами курьеру при
получении Заказа;
- Банковской картой в национальной валюте сум;
- посредством платежнной системы PayMe.

6. Возврат Товара
6.1. При получении Товаров Покупатель проверяет соответствие полученных
Товаров Заказу, комплектность и отсутствие претензий к внешнему виду
доставленного Товаров. Претензии Покупателя по внешнему виду Товаров и их
комплектности, после приемки Товара, не принимаются.
6.2. Продовольственные товары надлежащего качества возврату не подлежат.
6.3. Возврат Товара ненадлежащего качества:
6.3.1. Покупатель вправе возвратить Продавцу либо не принять Товар
ненадлежащего качества и потребовать возврата уплаченной цены такого Товара.
Клиент также может потребовать замены Товара ненадлежащего качества.
6.3.2. В случае отказа Покупателя от приемки Товара и предъявления им
требования о возврате уплаченной за Товар денежной суммы, в случае, если
указанная сумма уже была уплачена, сумма подлежит возврату Покупателю в
течение 10 (десяти) дней с момента получения Продавцом указанного требования в
письменной форме.
6.4. Возврат денежных средств:
6.4.1. Денежные средства подлежат возврату Покупателю способом, аналогичным
примененному им при оплате Товара: при оплате Заказа наличными денежными
средствами- возврат осуществляется денежными средствами из кассы Продавца,
при осуществлении платежа банковской картой- возврат денежных средств
производится на банковскую карту;
6.4.2. В случае если возврат наличных денежных
"""
